import React from "react";
import { useContacts } from "@/hooks/useContacts";

const DataAgreement = () => {
  const contacts = useContacts();
  const { data } = contacts;
  console.log(data);
  return (
    <div className="py-4 tablet:py-8">
      <div className="text-center mb-6 tablet:mb-12">
        <h1 className="text-4xl font-bold tracking-tight mb-4">
          Соглашение на обработку персональных данных
        </h1>
        <div className="h-1 w-20 bg-primary mx-auto"></div>
      </div>
      <div className="max-w-4xl mx-auto space-y-4">
        <p>
          Настоящим в соответствии с Федеральным законом{" "}
          <b>№ 152-ФЗ «О персональных данных»</b> от 27.07.2006 года Вы
          подтверждаете свое согласие на обработку нашей компанией персональных
          данных: сбор, систематизацию, накопление, хранение, уточнение
          (обновление, изменение), использование, передачу исключительно в целях
          продажи программного обеспечения на Ваше имя, как это описано ниже,
          блокирование, обезличивание, уничтожение.
        </p>
        <p>
          Наша компания гарантирует конфиденциальность получаемой информации.
          Обработка персональных данных осуществляется в целях эффективного
          исполнения заказов, договоров и иных обязательств, принятых нашей
          компанией в качестве обязательных к исполнению.
        </p>
        <p>
          В случае необходимости предоставления Ваших персональных данных
          правообладателю, дистрибьютору или реселлеру программного обеспечения
          в целях регистрации программного обеспечения на ваше имя, вы даёте
          согласие на передачу ваших персональных данных. Наша компания
          гарантирует, что правообладатель, дистрибьютор или реселлер
          программного обеспечения осуществляет защиту персональных данных на
          условиях, аналогичных изложенным в Политике конфиденциальности
          персональных данных.
        </p>
        <p>
          Настоящее согласие распространяется на следующие Ваши персональные
          данные: фамилия, имя и отчество, адрес электронной почты, почтовый
          адрес доставки заказов, контактный телефон, платёжные реквизиты.
        </p>
        <p>
          Срок действия согласия является неограниченным. Вы можете в любой
          момент отозвать настоящее согласие, направив письменное уведомления на
          адрес:{" "}
          <b>
            {" "}
            <span>{data.city}, </span>
            <span>{data.address}</span>
          </b>
          , офис с пометкой{" "}
          <b>«Отзыв согласия на обработку персональных данных»</b>
        </p>
        <p>
          Обращаем ваше внимание, что отзыв согласия на обработку персональных
          данных влечёт за собой невозможность пользования нашими
          интернет-сервисами.
        </p>
        <p>
          Гарантирую, что представленная мной информация является полной, точной
          и достоверной, а также что при представлении информации не нарушаются
          действующее законодательство Российской Федерации, законные права и
          интересы третьих лиц. Вся представленная информация заполнена мною в
          отношении себя лично.
        </p>
        <p>
          <b>
            Настоящее согласие действует в течение всего периода хранения
            персональных данных, если иное не предусмотрено законодательством
            Российской Федерации.
          </b>
        </p>
      </div>
    </div>
  );
};

export default DataAgreement;
